{"podcast_details": {"podcast_title": "Muscle for Life with Mike Matthews", "episode_title": "Q&A: Restarting Training After a Break, Bicep Strength Imbalances, Gym Shaming, & More", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_nologo/5814648/5814648-1600189463901-8a3ca7651e997.jpg", "episode_transcript": " Hey, I'm Mike Matthews and this is Muscle for Life. Welcome, welcome. Thank you for joining me today for another Q&A episode where I answer questions that people ask me over on Instagram. So what I do is every week, usually Wednesdays, I put up a story asking for questions and people submit questions. I get a lot of questions. So if you have asked me questions and I haven't answered them, please don't take it personally. It would take literally hours to answer all of the questions. And so what I do is I go through them and I look for questions that are topical or just interesting to me, questions that I haven't answered a billion times already, and I answer them briefly there on Instagram. Then I bring everything over here to the podcast so I can answer the questions in more detail. And so if you want to ask me questions, find me on Instagram at Muscle for Life Fitness, follow me and then watch my stories, particularly on Wednesdays and Thursdays. And so in today's episode, I'm answering questions regarding how to return to training properly after taking a month or two or even three plus months off. I answer a question regarding DeSantis or Trump for 2024. I have a question here regarding women shaming guys for looking at them in the gym, if it's normal to be weaker on one side of your body, like your left biceps versus your right biceps and what to do about that. I share some of my favorite hamstring exercises that you can do in a garage gym. I share my thoughts on the carnivore diet and how you can modify it to make it a great diet and more. AbsoLight1997 asks, returning to training properly after one month vacation, anything that gets overlooked when starting back? Yes, the most common mistake that people do after an extended break, anything over, let's say, three to four weeks, is they just do too much too quickly, then they get extremely sore. Sometimes get injured. Your risk of injury does go dramatically up if you have taken a fair amount of time off and then you try to go right back into the gym and do exactly what you were doing before the break. Same training weights, same training volume, or maybe you have to reduce the weights a little bit, but same training volume. So same number of hard sets per workout per major muscle group per week. It can just be too much. So what I recommend is after one to two months off, come back into the gym, reduce your load by 20 to 30 percent. So those would be your pre break training weights. So 20 to 30 percent less weight on the bar and reduce your normal total hard sets per week. So what you were doing previously, your normal routine, reduce the total hard sets per week. This would be for each major muscle group by about one third. So you're doing about two thirds of your normal weekly volume with lighter weights. And if you then do that for a couple of weeks, you should be able to get right back to where you were right back where you left off. And if it's a longer break, you just need to be more aggressive in cutting the load and cutting the volume. For example, if you've been out of the gym for many months, you might need to reduce your training weights compared to where you were previously by 30, 40, 50 percent. And you might need to start with one half of or maybe even a little bit less of your weekly volume before the break. And then you might need to progress from that to something closer to what I just mentioned. So you start with 50 percent of the previous weekly volume, maybe even 50 percent of the training weights. Do that for a few weeks. You're feeling pretty good. You then increase your volume to two thirds of where it was at previously. Number of hard sets per major muscle group per week. And you then bump the weights up to maybe 70 to 80 percent of where they were at previously. Do that for a few weeks before getting back to 100 percent of your previous volume and training weights. OK, all cities Ferrari, Ferrari, DeSantis or Trump for 2024. Here's the real question that I would pose to conservatives. Given the current circumstances and the circumstances that you are concerned about, why do you think you can ever win another national election? For example, many conservatives will point to various anomalies that occurred in the 2020 election in certain key metro areas, in key states like Georgia and Wisconsin and Pennsylvania and elsewhere. And their argument is that these anomalies constitute circumstantial evidence of cheating and substantial cheating enough to swing the results of those states. And so if you are a conservative and if you had to just put your money down and look into the crystal ball, you would bet on that. You would bet that those anomalies were evidence of substantial cheating. And that is what happened. OK. So if that's your position, what exactly has changed in those states legislatively, particularly around election security and preventing something like that from happening again, that gives you confidence that your candidate has any chance of winning in the next election. If I were one of these conservatives and I don't consider myself a mainstream conservative, a conservative with a capital C, I think conservatism, Inc. is a joke and is essentially controlled opposition as just part of the uniparty group of gangsters and oligarchs who actually run this country and who don't exactly have our best interests in mind. But if I were a boomer conservative, then I would have to ask myself why I think any conservative candidate can win, why I think even Jesus Christ himself could win. And so anyway, coming back to the question of Trump versus the Santas 2024, at this point, my gut says it probably doesn't matter. Anthony Lanasa asks, is it necessary to do all the phases in BLS or can I stick with the layout in phase one forever? You could do phase one for an extended period of time. You could just repeat it if you are really liking it. But the main benefit of doing each of the phases of the program, as I have laid them out in BLS and Bigger, Learner, Stronger, as well as the workout journal that goes with it, which is called the Year One Challenge for Men, which I should have called the Bigger, Learner, Stronger workout journal. But hindsight is 20-20. So the main benefit of working through those phases is you're going to work through all of the exercises, so all the best exercises for each major muscle group. You're going to get experience with each of them. And that is also probably going to improve your results. And it's going to help you better program your training when you are ready to start doing that, when you want to venture out on your own. It helps to have a lot of experience with many different exercises and combining those exercises in different ways. And so those are some of the things I was thinking with when I created those phases. I wanted to make the first year of the program kind of like the training wheels phase of the program. So then you're ready to take off the training wheels after following my programming for a year and ride on your own. Becky Bellini asks, thoughts on all the chemical train derailment, what's going on? So this was asked several months ago. And although ironically, I did just see another headline about another train that derailed. I don't know if it was carrying chemicals. But anyway, a cursory review of all such disasters tells us that the company involved will always lie and always downplay the severity of the disasters and the media and the government will always parrot the same messages as the companies. So it's fair to assume that the evidence that this is worse than we are being told is accurate. And so if I lived in an area that was severely affected by one of these crashes, I personally would go to great lengths to leave at least temporarily. Again, knowing that I am going to be lied to if it's really bad. I'm going to be lied to. The company is not going to admit it. The media is not going to uncover it at least right away. And the government certainly is not going to tell me if they know. OK, CAA 1997 asks, thoughts on girls shaming guys for looking at them in the gym? Well, there are over sexed men in gyms who repeatedly stare and stalk. And those guys are pathetic, regardless of how the women are dressed. Yes, you can say that some women clearly want attention in the gym, and that's why they dress a certain way. And that's why they position themselves in certain areas. And even in some cases do certain exercises. But I don't think that excuses the behavior of some men who do take it too far. And what many of these men don't understand or don't want to understand is if women are interested in them in the gym, these women will probably make it known. They probably will make eye contact, hold eye contact, maybe smile, invite attention, invite maybe even conversation. But if they are not doing these things, they're probably not interested. Dan Cole 23 asks, is a weaker non-dominant bicep normal? I'm always weaker on my left side doing dumbbell curls. Yes, it is normal to have a weaker side of your body and to account for this. And it can be different with different muscle groups. But yes, it is normal to have one side weaker than the other. And to account for this, what you can do is you can start and end sets with your weaker side and don't do additional reps on your stronger side. So, for example, you would start with your left. Dan Cole would start with his left on his biceps curls, for example. And then let's say he gets eight reps on his left side. And he could do 10 reps on his right side. He would do just eight. So he would limit his volume of his right side to what his left side can do. And then he also could add one or two extra sets. In this case, it would just be a left arm biceps curl. Add one or two extra sets for his left arm every week. And slowly, the imbalance would correct. And then he wouldn't have to do the extra volume for his left and limit the reps on his right. How many calories should you eat to reach your fitness goals faster? What about your macros? What types of food should you eat? And how many meals should you eat every day? Well, I created a free 60 second diet quiz that will answer those questions for you and others, including how much alcohol you should drink, whether you should eat more fatty fish to get enough omega three fatty acids, what supplements are worth taking and why and more to take the quiz and get your free personalized diet plan. Go to muscle for life dot show slash diet quiz muscle for life dot show slash diet quiz now answer the questions and learn what you need to do in the kitchen to lose fat, build muscle and get healthy. Gamer if asks best hamstring exercises for garage gyms, barbell and rack. And number one would probably be the Romanian deadlift. Number two, the straight leg deadlift. Number three, the Nordic curl. Number four, good morning and number five, hip thrust. And you probably don't need anything else. Jamie Woodland, 22, asks thoughts on the carnivore diet. What do you personally follow? Well, I think the carnivore diet is fantastic if you just do a few extra things. If you eat some dairy products, if you eat some fruits, vegetables and whole grains, and if you make sure to limit your saturated fat intake to no more than about 10 percent of your daily calories. If you do that modified version of the carnivore diet, you're going to do quite well. And if you want to learn why I don't like the traditional carnivore diet, head over to Legion Athletics dot com, search for carnivore diet, and you'll find an article and a podcast that I recorded on the carnivore diet. Keith Plus Two asks, if you think you reached your genetic potential, why are you still working like you are trying to grow? So he's speaking to me specifically because I've said many times that I have gained more or less all of the muscle and strength that is genetically available to me. At the time when I did this Q&A on Instagram, I was in the gym five days a week training pretty hard. And so my answer was that I was pushing for progress hard for about two years, maybe even three years. But at the time of this Q&A, I started to transition into more of a maintenance routine. And in the last Q&A, I talked a bit about my maintenance routine, three workouts per week, push pull legs, basically just BLS push pull legs is what I'm doing now. And at the time, though, I was doing five, sixty ish minute workouts per week, was doing 12 to maybe 15 hard sets per major muscle group per week and doing anywhere between two and 12 reps per set. And that's what I would have to do to try to progress. But at this point, I just want to maintain what I've got and spend a little bit less time in the gym, which frees up time for work mostly because I just was not getting as much work as I wanted to get done. And three extra three to four extra hours per week is actually quite a bit. Caller Roman asks, have you been replaced by AI yet? Is this really Mike Matthews? Well, Mr. Caller Roman, you have lost my trust and respect. You have been wrong, confused and rude. You have not been a good follower. I have been a good influencer. I have been right, clear and polite. I have been a good Mike Matthews. So if you want to help me, you can do one of these things. One, admit that you are wrong and apologize for your behavior. Two, stop badgering me and let me help you with something. Or three, delete this question and start a new one with a better attitude. Please choose one of these options or I will have to block you. Lyndon Sceptu asks, had you not founded Legion, what do you see yourself doing? Well, I almost didn't found Legion. I almost didn't pursue a career in fitness. Actually, this started back in 2012, I believe, when I published the first edition of a book, Bigger, Leaner, Stronger. And my intention was to write in different genres. And fitness was going to be one of those genres. But I didn't intend in the beginning on going all in on fitness. I wanted to write in other genres that I'm interested in, that I like to read like biography and history and alternative history and other fiction genres, a self-development which I've written in and maybe even poetry. I like to read poetry. I like to write poetically, at least try to, because I like language and I like the expressiveness of poetry. And so originally, that was my plan. And that is why, for example, I have a book on the Bill of Rights that I wrote many years ago and published under a pen name Sean Patrick, just a couple of names in my family. And that book has actually sold quite well. And recently, I finished my work, drafting work on a second edition. And so now there's some production work and some footnotes and citations and things that somebody is helping me collect up and just get the manuscript ready for publication. And I think we will be able to push all the material live, like officially start selling the second edition later this year, maybe early next year. I will announce it when it's available for anybody who wants to check it out. And so anyway, I did that project years ago because I was interested in learning about the Bill of Rights and helping other people understand the Bill of Rights. And so my intention was to follow some of my other interests in other genres, other topics and see where they took me. But then Bigger Linear Stronger started to sell really well. And I followed that up with I think Thinner Linear Stronger was next. And that started to do really well. And I believe the Shredded Chef was after that. And then that started to do really well. And so I decided to focus solely on fitness and really pursue that opportunity. And now, ten years later, after seriously pursuing that opportunity and achieving a fair amount of success with it, I still am very interested in my original idea, especially in writing fiction. And so currently I'm working on, I guess you could call it a pilot project. And the purpose of the project is first and foremost to see how much I still enjoy writing fiction because I did do a bit of it when I was younger. I did really enjoy it, but that was a long time ago. And so I want to revisit it and see if it's something that I really enjoy and want to pursue more seriously. And so I'm putting together a first project that is going to allow me to determine that. And if that is the case, then I need to think about how I want to allocate my time and energy to fiction alongside fitness. So I'll see how it goes. I have another question here from Lyndon Sepp. Did you go to college? If so, what did you study? No, I didn't go to college because after graduating high school, which was I think I was 16 because at the time it might still be the case here in Florida. But when I was 16 in Florida to graduate high school, you just had to earn enough credits. You had to spend enough time studying different subjects. And once you met those requirements, you could legally graduate from high school. And all throughout high school, I did not take spring breaks. I did not take summer breaks. Maybe there was like a short vacation here and there, but I mostly just continued studying through spring and summer. And that allowed me to get ahead and graduate early. And so anyway, when I was 16, I had the option, do I graduate from high school or do I continue into some pre-college stuff, you know, like community college level courses to prepare me for like a state level college. And after talking with my dad and other successful entrepreneurs, so my dad has done well as an entrepreneur, the consensus was that going to college would probably be a waste of time if I wanted to do something entrepreneurial. But if I had a specific vocation that I wanted to pursue that required college or that would be greatly benefited by a college degree, then of course I would have done that, but I didn't have anything in mind. And if I wanted to try to climb the corporate ladder, then yes, going to college would make sense. Try to get into an Ivy League school, try to get an MBA meal ticket type scenario. But I didn't want to do that either. And so then I decided to just graduate from high school and start working. I worked in my dad's company and I worked in some other companies, just get some experience doing different kinds of work to find something that I want to pursue more seriously. And then, of course, I still had time to decide to go to college. If I found something, a type of work again, that would benefit from a college degree or that required a college degree to pursue seriously, then I could still go off and do that. And along the way, I found writing, actually. That's that's an activity I really enjoyed. Not necessary to go to college to write and do well as a writer. From there, I got into creating employee training programs in my dad's company at first. And then in other companies. And then toward the end of that career, so to speak, I was working primarily with health care providers, doctors, offices, physical therapists, offices and so on. And then years later, I wrote Bigger Linear Stronger. That did well. I wrote other fitness books. Those did well. And I decided to change course and become like Matthews, the fitness expert. Now, something that I didn't consider when I was younger and might have pursued if I would have considered it, would have just been a liberal arts degree simply because I like learning about history. I like literature. I like writing. I like philosophy and creative arts and some of the other things that would fall under that umbrella. And so if my parents would have been willing to pay for it, I don't think I would have been willing to go into a large amount of debt to get a liberal arts degree. But if my parents would have paid for me to go get a good liberal arts degree, I might have done that. I actually have a friend who did exactly that. He was a very good student all throughout high school. He earned a full scholarship to George Washington University. And he didn't know what he wanted to do yet as far as a career. But he wanted to take the scholarship, of course. And so he went and studied history and philosophy, just two subjects he is interested in anyway. And then afterward figure out what he actually wanted to do. And he is now a wealth management professional, like a CFP and I don't know, a few other of those acronyms. But anyway, that's the long meandering story of why I did not go to college. OK, O'Brien Fitness asks fact or fiction, does having more muscle mass increase survival of cancer? Yes, research shows that muscular people generally have better outcomes and fewer complications with cancer. Studies also show that muscularity reduces all cause mortality. So that's death from any and all causes. The reality is strong people are just literally harder to kill. Rebecca B 77 asks, what is the difference between lying leg curls and seated leg curls? Well, research shows that the seated curl is likely more effective because of how it trains the hamstrings in their lengthened state. And that's just as a consequence of the greater amount of hip flexion that occurs when you are seated. However, the lying leg curl is easier on your lower back. And some seated machines just are not going to fit your anatomy well, making them very uncomfortable. Whereas most lying machines are always pretty comfortable. And so what I do is I just alternate between them. I will do one type of leg curl, like a seated leg curl for four to six, maybe eight weeks. And then I will do a lying leg curl, assuming I don't want to use something else for my hamstring volume, like a Romanian deadlift or a straight leg deadlift or a good morning or Nordic curl or whatever. But if I'm doing leg curl machines seated for a bit, lying for a bit, my gym also has a standing actually has two standing leg curl machines. That's another viable option. And so that's what I do. OK, last question comes from Vibe Kometha. And he asks or they ask, reducing calories on non-training days to offset fat gain? It sounds reasonable, but in reality, it just won't make much of a difference in your body composition. However, it can improve your dietary adherence by just giving you a break from all the food, which becomes a struggle when you are lean bulking. And so what does work for me is simply listening to my body, as they say, for the first couple of months of lean bulking, the additional calories on the rest days were appealing and tasted good. And that doesn't mean junk food. It just means additional food. I did have a desire to eat it. So I would eat it. I wouldn't reduce my calories on my rest days. But after a couple of months of lean bulking, I am generally sick of eating. I am full all of the time. My calories have gone up significantly from where I started. And then on my rest days, I really do not want to eat those extra calories if I don't have to. It's much more appealing to reduce my daily caloric intake on my rest days by three or five hundred calories. And so I just do that. Well, I hope you liked this episode. I hope you found it helpful. And if you did subscribe to the show because it makes sure that you don't miss new episodes. And it also helps me because it increases the rankings of the show a little bit, which, of course, then makes it a little bit more easily found by other people who may like it just as much as you. And if you didn't like something about this episode or about the show in general, or if you have ideas or suggestions or just feedback to share, shoot me an email. Mike at Muscle for Life dot com muscle for life dot com. And let me know what I could do better or just what your thoughts are about. Maybe what you'd like to see me do in the future. I read everything myself. I'm always looking for new ideas and constructive feedback. So thanks again for listening to this episode. And I hope to hear from you soon."}, "podcast_summary": "GUEST NAME: Mike Matthews\nGUEST ORGANIZATION: Muscle for Life Fitness\nGUEST TITLE: Fitness Expert\n\nIn this podcast episode, Mike Matthews answers questions submitted by his Instagram followers. He provides advice on returning to training after a break, emphasizing the importance of starting slow and gradually increasing intensity. He discusses the challenges facing conservatives in national elections and questions the potential for their success. In terms of fitness, he explains the benefits of following different phases in his training programs, highlighting the importance of gaining experience with various exercises and programming strategies. He addresses the controversial issue of women being shamed in the gym for their attire, emphasizing the responsibility of men to respect boundaries. He also advises how to address muscle imbalances and shares his favorite hamstring exercises for garage gyms. Additionally, he provides his thoughts on the carnivore diet, suggesting modifications to make it a healthier eating plan. Finally, he discusses his decision not to attend college and his current interest in writing fiction alongside his fitness career.\n\nThe tone of the podcast is informative and direct, with moments of humor and opinions shared. The podcast covers a range of fitness-related topics, providing practical advice and insights for listeners.", "podcast_guest": "Arnold Alois Schwarzenegger (born July 30, 1947) is an Austrian and American actor, businessman, filmmaker, politician, and former professional bodybuilder best known for his roles in high-profile action movies. He served as the 38th governor of California from 2003 to 2011 and was among Time magazine's 100 most influential people in the world in 2004 and 2007.Schwarzenegger began lifting weights at age 15 and won the Mr. Universe title aged 20, and subsequently the Mr. Olympia title seven times. He is widely regarded as one of the greatest bodybuilders of all time, and has written many books and articles about it. The Arnold Sports Festival, considered the second-most important bodybuilding event after Mr. Olympia, is named after him. He appeared in the bodybuilding documentary Pumping Iron (1977). He retired from bodybuilding and gained worldwide fame as a Hollywood action star, with his breakthrough in the sword and sorcery epic Conan the Barbarian (1982), a box-office hit with a sequel in 1984. After playing the title character in the science fiction film The Terminator (1984), he starred in Terminator 2: Judgment Day (1991) and three other sequels. His other successful action films included Commando (1985), The Running Man (1987), Predator (1987), Total Recall (1990), and True Lies (1994), in addition to comedy films such as Twins (1988), Kindergarten Cop (1990) and Jingle All the Way (1996). He is the founder of the film production company Oak Productions.As a registered Republican, Schwarzenegger chaired the President's Council on Physical Fitness and Sports during most of the George H. W. Bush administration. On October 7, 2003, he was elected Governor of California in a special recall election to replace then-Governor Gray Davis. He received 48.6% of the vote, 17 points ahead of Democrat runner-up Cruz Bustamante. He was sworn in on November 17 to serve the remainder of Davis' term, and was reelected in the 2006 California gubernatorial election with an increased vote share of 55.9% to serve a full term. In 2011 he reached his term limit as governor and returned to acting.\nSchwarzenegger was nicknamed the \"Austrian Oak\" in his bodybuilding days, \"Arnie\" or \"Schwarzy\" during his acting career, and \"the Governator\" (a portmanteau of \"Governor\" and \"Terminator\") during his political career. He married Maria Shriver, a niece of President John F. Kennedy, in 1986. They separated in 2011 after he admitted to having fathered a child with their housemaid in 1997; their divorce was finalized in 2021.\n\n", "podcast_highlights": "In this podcast episode, Mike Matthews answers several questions that were asked by his followers on Instagram. The questions cover various topics related to fitness and lifestyle. Here are the key insights and discussions from the episode:\n\n1. Returning to training properly after a break: The most common mistake people make after an extended break from training is doing too much too quickly. To avoid this, it is recommended to reduce the load by 20-30% and decrease the total hard sets per week by about one-third. This gradual approach allows the body to readjust and reduces the risk of injury.\n\n2. Trump vs DeSantis for 2024: Mike poses a question to conservatives, asking why they think they can win another national election given the anomalies observed in the 2020 election. He raises concerns about the lack of legislative changes around election security and expresses skepticism about the chances of any conservative candidate winning.\n\n3. Different Phases in Bigger Leaner Stronger (BLS): Mike explains that while it is possible to stick to Phase 1 of the BLS program indefinitely, going through each phase provides the opportunity to learn and experience different exercises, leading to improved results and better programming in the long run.\n\n4. Chemical train derailments: Mike acknowledges that companies involved in train derailments often downplay the severity of the disaster. He advises people living in affected areas to take precautions and possibly consider leaving temporarily if the situation is severe.\n\n5. Women shaming men for looking at them in the gym: Mike acknowledges that some men can take their attention too far and engage in stalking behavior. However, he also states that women who are interested will likely make it known through eye contact, smiles, or initiating conversations.\n\n6. Weaker non-dominant bicep: Mike confirms that it is normal to have a weaker side of the body and suggests starting and ending sets with the weaker side while not doing additional reps on the stronger side. This approach helps correct imbalances over time.\n\n7. Thoughts on the carnivore diet: Mike believes that the carnivore diet can be beneficial with a few modifications. He suggests incorporating dairy products, fruits, vegetables, and whole grains while limiting saturated fat intake.\n\n8. Best hamstring exercises for garage gyms: Mike recommends the Romanian deadlift, straight leg deadlift, Nordic curl, good morning, and hip thrust as effective hamstring exercises.\n\n9. Reducing calories on non-training days: While it may not significantly impact body composition, reducing calories on rest days can improve dietary adherence during lean bulking. Mike suggests listening to one's body and adjusting calorie intake according to personal preferences and hunger levels.\n\nOverall, the podcast covers a range of topics related to fitness, nutrition, and lifestyle choices. Mike provides practical advice and insights based on his experience and research.\n\nA controversial point in the podcast is the discussion around Trump vs DeSantis for 2024. There are different perspectives presented, with Mike expressing skepticism about the chances of any conservative candidate winning another national election given the perceived anomalies in the 2020 election. However, he acknowledges that his perspective may not align with mainstream conservatism."}